driver-tests/bpelse/scalability/ScalabilityJbi/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tt="http://java.sun.com/products/oss/xml/TroubleTicket" xmlns:com="http://java.sun.com/products/oss/xml/Common" xmlns:mon="http://java.sun.com/products/oss/xml/QualityOfService/FM/Monitor" xmlns:thr="http://java.sun.com/products/oss/xml/QualityOfService/PM/Threshold" xmlns:meas="http://java.sun.com/products/oss/xml/QualityOfService/PM/Measurement">
    <soapenv:Body>
        <tt:createTroubleTicketByValueRequest>
            <tt:troubleTicketValue>
                <!--Optional:-->
                <tt:troubleTicketKey>
                    <!--Optional:-->
                    <com:applicationContext>
                        <com:factoryClass>?string?</com:factoryClass>
                        <com:url>?http://www.company.org/cum/sonoras?</com:url>
                        <com:systemProperties>
                            <!--Zero or more repetitions:-->
                            <com:property>
                                <com:name>?string?</com:name>
                                <com:value>?string?</com:value>
                            </com:property>
                        </com:systemProperties>
                    </com:applicationContext>
                    <!--Optional:-->
                    <com:applicationDN>?string?</com:applicationDN>
                    <com:type>?string?</com:type>
                    <tt:primaryKey>1</tt:primaryKey>
                </tt:troubleTicketKey>
                <tt:customer>
                    <tt:email>John Doe</tt:email>
                    <tt:fax>String</tt:fax>
                    <tt:location>
                        <tt:addressInfo>String</tt:addressInfo>
                    </tt:location>
                    <tt:name>Some New Customer 1</tt:name>
                    <tt:number>String</tt:number>
                    <tt:organizationName>String</tt:organizationName>
                    <tt:phone>String</tt:phone>
                    <tt:responsible>String</tt:responsible>
                    <tt:sMSAddress>String</tt:sMSAddress>
                </tt:customer>
                <tt:troubleDescription>No Coverage</tt:troubleDescription>
                <tt:baseFoundType>SWITCHTROUBLE</tt:baseFoundType>
                <tt:baseTroubleType>CIRCUITDEAD</tt:baseTroubleType>
                <tt:baseState>OPENACTIVE</tt:baseState>
            </tt:troubleTicketValue>
        </tt:createTroubleTicketByValueRequest>
    </soapenv:Body>
</soapenv:Envelope>